#-----------------------------------------------------------------------------------------#
### index: val의 index를 return (list의 함수)
### BOJ 9440 # 2022.08.08
nums = [1,1,2,3]
print(nums.index(2)) # --> return 2 
print(nums.index(1)) # --> return 0 (1번째로 나오는 값)

#-----------------------------------------------------------------------------------------#
### del: index에 해당되는 값 삭제 기능
del nums[2] # --> index 2번 삭제

#-----------------------------------------------------------------------------------------#
### 숫자에서 문자로, 문자에서 숫자로
num, string = 1, '1'
str(num), int(string)

#-----------------------------------------------------------------------------------------#
### range 숫자 거꾸로 세는 방법.
### BOJ 3273 # 2022.08.09
for j in range(7, -1, -2):
    # i, j는 포인터
    print(j) # --> [7,5,3,1]
# 7부터 -1이 될까지 세는데, 이때 -2씩 줄어든다. 
# 맨 마지막 step의 default는 1. 
# https://appdividend.com/2022/06/07/how-to-reverse-a-range-in-python/ 

#-----------------------------------------------------------------------------------------#
### set 함수 #교집합 #합집합 #차집합
A = [3,4,4,1]
A_set = set(A) # 1,3,4
print(list(A_set))

B = {1,2,3}
print(A_set&B) # 1,3 (교집합)
print(A_set|B) # 1,2,3,4 (합집합)
print(A_set-B) # 4 (차집합)

#-----------------------------------------------------------------------------------------#
### 나누기, 몫
# '/'는 일반 나누기, '//' 몫을 리턴. '%' 나머지
print(5/2, 5//2, 5%2)  
n, m = divmod(5, 2) # n은 몫, m는 나머지
print(n,m)

#-----------------------------------------------------------------------------------------#
### upper, lower: 대문자, 소문자 변경
print('seil'.upper())

#-----------------------------------------------------------------------------------------#
### print 한줄 안 띄기 + 두개 print할 떄 붙여 넣기. (seperate)
for i in range(6): 
    print(i, end=' ')

print("띄어쓰기", "없이", sep="") # sep는 seperate의 약자
print("중간에", "넣기", sep=" 문자!! ") # sep는 seperate의 약자
#-----------------------------------------------------------------------------------------#
### 내림 (이진탐색 시 활용)
int(1.5)

#-----------------------------------------------------------------------------------------#
### 소수점 자리수 제한 (format 함수)
print("{:.3f}%".format(40)) # 40.000% 로 출력