### 리스트 컴프리헨션 : 1 ~ 7까지 숫자 중, 짝수들을 곱하기 4한, 값들을 모아둔 리스트
calculated_list = [n * 4 for n in range(1,8) if n % 2 == 0]

#-----------------------------------------------------------------------------------------#
### input: list로 변경하기 (-> [1,2,3])
scores = list(map(int, input().split()))

#-----------------------------------------------------------------------------------------#
### 0 제외 최소값 구하기 #filter , #lambda, #map
### BOJ 9440 # 2022.08.08
# https://wikidocs.net/64
numbers = [0,1,2,3]
print(min(filter(lambda x: x > 0, numbers))) # --> [1,2,3] --> 1
print(map(lambda x: x > 0, numbers)) # --> [False, True, True, True]

#-----------------------------------------------------------------------------------------#
### reduce: 누적적으로 함수에 적용시키는.
from functools import reduce 
print(reduce(lambda x, y: x + y, [1, 3, 5, 7]))
print(reduce(lambda x, y: y + x, 'abcde')) # 반대. #'edcba'
# 1회차: x=1, y=3 -> 1+3 = 4
# 2회차: x=4, y=5 -> 4+5 = 9
# 3회차: x=9, y=7 -> 9+7 = 16 # 정답은 16

#-----------------------------------------------------------------------------------------#
