#-----------------------------------------------------------------------------------------#
### index: val의 index를 return (list의 함수)
### BOJ 9440 # 2022.08.08
nums = [1,1,2,3]
print(nums.index(2)) # --> return 2 
print(nums.index(1)) # --> return 0 (1번째로 나오는 값)

#-----------------------------------------------------------------------------------------#
### del: index에 해당되는 값 삭제 기능
del nums[2] # --> index 2번 삭제

#-----------------------------------------------------------------------------------------#
### 숫자에서 문자로, 문자에서 숫자로
num, string = 1, '1'
str(num), int(string)

#-----------------------------------------------------------------------------------------#
### range 숫자 거꾸로 세는 방법.
### BOJ 3273 # 2022.08.09
for j in range(7, -1, -2):
    # i, j는 포인터
    print(j) # --> [7,5,3,1]
# 7부터 -1이 될까지 세는데, 이때 -2씩 줄어든다. 
# 맨 마지막 step의 default는 1. 
# https://appdividend.com/2022/06/07/how-to-reverse-a-range-in-python/ 

#-----------------------------------------------------------------------------------------#
